snlkuharlocal/src/Enums/ТипыДокументовИСМП/ТипыДокументовИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДокументовИСМП</name>
  <enumValues>
    <name>АктУничтожения</name>
    <comment>DESTRUCTION_ACT</comment>
  </enumValues>
  <enumValues>
    <name>КассовыйЧек</name>
    <comment>RECEIPT</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>OTHER</comment>
  </enumValues>
  <enumValues>
    <name>ТаможеннаяДекларация</name>
    <comment>CUSTOMS_DECLARATION</comment>
  </enumValues>
  <enumValues>
    <name>ТоварнаяНакладная</name>
    <comment>CONSIGNMENT_NOTE</comment>
  </enumValues>
  <enumValues>
    <name>ТоварныйЧек</name>
    <comment>SALES_RECEIPT</comment>
  </enumValues>
  <enumValues>
    <name>УПД</name>
    <comment>UTD</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыОперацийИСМП/ВидыОперацийИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийИСМП</name>
  <enumValues>
    <name>Агрегация</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот_Импорт</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот_МаркировкаОстатков</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_БезвозмезднаяПередача</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ВозвратФизическомуЛицу</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ДистанционнаяПродажа</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Прочее</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ИспользованиеДляСобственныхНужд</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Конфискация</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ПродажаПоГосударственномуКонтракту</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ПродажаПоОбразцам</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ПродажаПоСделкеСГосударственнойТайной</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_РозничнаяПродажа</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ТрансграничнаяПродажаВСтраныЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Уничтожение</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Утилизация</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Утрата</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ЭкспортЗаПределыСтранЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ДистанционнаяПродажа</name>
    <comment>Возврат при дистанционном способе продажи</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ИспользованиеДляПроизводственныхЦелей</name>
    <comment>Возврат товара, выведенного изоборота  для  производственных целей</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ИспользованиеДляСобственныхНужд</name>
    <comment>Возврат товара, выведенного из оборота для собственных нужд</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ПриобретениеНеДляПерепродажи</name>
    <comment>Возврат в оборот возврат приобретение не для перепродажи</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ПродажаЧерезВендинг</name>
    <comment>Возврат товара, выведенного из оборота для продажи  через  вендинговый аппарат</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_РозничнаяРеализация</name>
    <comment>Возврат при розничной реализации</comment>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаВЕАЭС</name>
    <comment>Отгрузка в ЕАЭС</comment>
  </enumValues>
  <enumValues>
    <name>РасформированиеУпаковки</name>
  </enumValues>
  <enumValues>
    <name>СписаниеНеНанесенных_Испорчен</name>
    <comment>Списание не нанесееных КМ. Испорчен.</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеНеНанесенных_Уничтожен</name>
    <comment>Списание не нанесееных КМ. Уничтожен.</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеНеНанесенных_Утерян</name>
    <comment>Списание не нанесееных КМ. Утерян.</comment>
  </enumValues>
  <enumValues>
    <name>ФормированиеНабора</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ВозвратБезКМ</name>
    <comment>RETAIL_RETURN</comment>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ВозвратБезКМ_ДистПродажи</name>
    <comment>REMOTE_SALE_RETURN</comment>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ВозвратОтКонечногоПокупателя</name>
    <comment>LEGAL_RETURN</comment>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ВозвратРанееЭкспортированногоЕАЭС</name>
    <comment>EEC_EXPORT_RETURN</comment>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ИспорченоЛибоУтеряно</name>
    <comment>KM_SPOILED</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияУпаковки_Изъятие</name>
    <comment>REMOVING</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияУпаковки_Добавление</name>
    <comment>ADDING</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияАТК_Добавление</name>
    <comment>ADDING</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияАТК_Изъятие</name>
    <comment>REMOVING</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипыДокументовИСМП/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ВидОперацииИСМП = МаркировкаКС.ПолучитьЗначениеПараметра(Параметры, "ВидОперацииИСМП");
	Если ВидОперацииИСМП <> Неопределено Тогда
		СтандартнаяОбработка	= Ложь;		
		ДанныеВыбора			= Новый СписокЗначений;
		
		Строки = ТаблицаСоответствияВидовОпераций().НайтиСтроки(Новый Структура("ВидОперацииИСМП", ВидОперацииИСМП));
		Для Каждого Строка Из Строки Цикл		
			ДанныеВыбора.Добавить(Строка.ТипДокументаИСМП);
		КонецЦикла;		
	КонецЕсли;	
КонецПроцедуры


Функция ТаблицаСоответствияВидовОпераций()
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ВидОперацииИСМП");
	ТЗ.Колонки.Добавить("ТипДокументаИСМП");	
	
	П1 = Перечисления.ВидыОперацийИСМП;
	П2 = Перечисления.ТипыДокументовИСМП;
	
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ДистанционнаяПродажа,						П2.КассовыйЧек, 		ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ДистанционнаяПродажа,						П2.ТоварныйЧек, 		ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ДистанционнаяПродажа,						П2.ТоварнаяНакладная, 	ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ДистанционнаяПродажа,						П2.УПД, 				ТЗ);
	
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_Прочее, 									П2.Прочее, 				ТЗ);	
	
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_РозничнаяПродажа, 							П2.КассовыйЧек, 		ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_РозничнаяПродажа, 							П2.ТоварныйЧек, 		ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_РозничнаяПродажа, 							П2.Прочее, 				ТЗ);
	
	//ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ТрансграничнаяПродажаВСтраныЕАЭС, 		П2., 	ТЗ);
	
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_БезвозмезднаяПередача, 					П2.ТоварнаяНакладная, 	ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_БезвозмезднаяПередача, 					П2.Прочее, 				ТЗ);	
	
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ВозвратФизическомуЛицу, 					П2.Прочее, 				ТЗ);
	
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ИспользованиеДляСобственныхНужд, 			П2.Прочее, 				ТЗ);
	
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_Конфискация, 								П2.Прочее, 				ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_Конфискация, 								П2.ТоварнаяНакладная, 	ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_Конфискация, 								П2.УПД, 				ТЗ);
	
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ПродажаПоОбразцам, 						П2.КассовыйЧек, 		ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ПродажаПоОбразцам, 						П2.Прочее, 		ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ПродажаПоОбразцам, 						П2.ТоварнаяНакладная, 	ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ПродажаПоОбразцам, 						П2.УПД, 				ТЗ);
	
	//ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ПродажаПоГосударственномуКонтракту, 		П2., 	ТЗ);
	
	//ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ПродажаПоСделкеСГосударственнойТайной, 	П2., 	ТЗ);	
	
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_Уничтожение, 								П2.АктУничтожения, 		ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_Уничтожение, 								П2.Прочее, 				ТЗ);
	
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_Утилизация, 								П2.Прочее, 				ТЗ);
	
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_Утрата, 									П2.Прочее, 				ТЗ);
	
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ЭкспортЗаПределыСтранЕАЭС, 				П2.ТаможеннаяДекларация,ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВыводИзОборота_ЭкспортЗаПределыСтранЕАЭС, 				П2.Прочее, 				ТЗ);
	
	ДобавитьСтрокуСоответствия(П1.ВозвратВОборот_Возврат_ДистанционнаяПродажа, 				П2.КассовыйЧек,			ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВозвратВОборот_Возврат_ДистанционнаяПродажа, 				П2.ТоварныйЧек,			ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВозвратВОборот_Возврат_ДистанционнаяПродажа, 				П2.Прочее,				ТЗ);
	
	ДобавитьСтрокуСоответствия(П1.ВозвратВОборот_Возврат_РозничнаяРеализация, 				П2.КассовыйЧек,			ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВозвратВОборот_Возврат_РозничнаяРеализация, 				П2.ТоварныйЧек,			ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВозвратВОборот_Возврат_РозничнаяРеализация, 				П2.Прочее,				ТЗ);
	
	ДобавитьСтрокуСоответствия(П1.ВозвратВОборот_Возврат_ПриобретениеНеДляПерепродажи, 		П2.КассовыйЧек,			ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВозвратВОборот_Возврат_ПриобретениеНеДляПерепродажи, 		П2.ТоварныйЧек,			ТЗ);
	ДобавитьСтрокуСоответствия(П1.ВозвратВОборот_Возврат_ПриобретениеНеДляПерепродажи, 		П2.Прочее,				ТЗ);
	
	ДобавитьСтрокуСоответствия(П1.ПустаяСсылка(), 											П2.Прочее, 				ТЗ);
	
	Возврат ТЗ;
КонецФункции //ТаблицаСоответствияВидовОпераций()
 
Функция ДобавитьСтрокуСоответствия(ВидОперацииИСМП, ТипДокументаИСМП, ТЗ)
	СтрокаТЗ = ТЗ.Добавить();	
	
	СтрокаТЗ.ВидОперацииИСМП	= ВидОперацииИСМП;
	СтрокаТЗ.ТипДокументаИСМП	= ТипДокументаИСМП;
КонецФункции //ДобавитьСтрокуСоответствия(ВидОперацииИСМП, ТипДокументаИСМП, ТЗ)
